result/result_probably_consolidated/c6620(emerald)_consolidated_4core_8iothread_1/multiplier_64/run4.txt
# run=4/10
# 2026-04-06T01:19:00-06:00
# cmd: taskset -c 1-55 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            713790
        write:                           185849
        other:                           95382
        total:                           995021
    transactions:                        44397  (739.66 per sec.)
    queries:                             995021 (16577.23 per sec.)
    ignored errors:                      6588   (109.76 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      739.6623
    time elapsed:                        60.0233s
    total number of events:              44397

Latency (ms):
         min:                                    1.39
         avg:                                   43.25
         max:                                  289.57
         95th percentile:                       90.78
         sum:                              1920290.74

Threads fairness:
    events (avg/stddev):           1387.4062/23.25
    execution time (avg/stddev):   60.0091/0.01